In [11]:
import pandas as pd

In [12]:
df= pd.read_excel('https://github.com/chris78rey/DIPLOM_BIGDATA/blob/main/DATOS_PRUEBA.xlsx?raw=true')

In [13]:
df

     CATEGORIA  VALOR  VALOR 2           Date&Time
0        Item4     87    87.09 2021-08-01 18:07:20
1         Item     46    45.58 2021-08-01 21:02:37
2        Item5     84    84.28 2021-08-01 23:57:53
3        Item0     35    35.04 2021-08-02 02:53:10
4        Item2     10    10.25 2021-08-02 05:48:27
...        ...    ...      ...                 ...
2995     Item6     52    52.22 2022-08-01 07:26:13
2996      Item     89    88.94 2022-08-01 10:21:30
2997     Item3     16    15.70 2022-08-01 13:16:47
2998     Item1     12    11.84 2022-08-01 16:12:03
2999      Item     69    69.04 2022-08-01 19:07:20

[3000 rows x 4 columns]

In [14]:
df.reset_index

<bound method DataFrame.reset_index of      CATEGORIA  VALOR  VALOR 2           Date&Time
0        Item4     87    87.09 2021-08-01 18:07:20
1         Item     46    45.58 2021-08-01 21:02:37
2        Item5     84    84.28 2021-08-01 23:57:53
3        Item0     35    35.04 2021-08-02 02:53:10
4        Item2     10    10.25 2021-08-02 05:48:27
...        ...    ...      ...                 ...
2995     Item6     52    52.22 2022-08-01 07:26:13
2996      Item     89    88.94 2022-08-01 10:21:30
2997     Item3     16    15.70 2022-08-01 13:16:47
2998     Item1     12    11.84 2022-08-01 16:12:03
2999      Item     69    69.04 2022-08-01 19:07:20

[3000 rows x 4 columns]>

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CATEGORIA  3000 non-null   object
 1   VALOR      3000 non-null   int64
 2   VALOR 2    3000 non-null   float64
 3   Date&Time  3000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 93.9+ KB

In [20]:
new_var = df.groupby(['CATEGORIA'])
df_grupo_suma=new_var

In [21]:
dir(df_grupo_suma)

['CATEGORIA',
 'VALOR',
 '__annotations__',
 '__class__',
 '__class_getitem__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__orig_bases__',
 '__parameters__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slots__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_agg_examples_doc',
 '_agg_general',
 '_agg_py_fallback',
 '_aggregate_frame',
 '_aggregate_item_by_item',
 '_aggregate_with_numba',
 '_apply_allowlist',
 '_apply_filter',
 '_apply_to_column_groupbys',
 '_ascending_count',
 '_bool_agg',
 '_can_use_transform_fast',
 '_choose_path',
 '_concat_objects',
 '_constructor',
 '_cumcount_array',
 '_cython_agg_general',
 '_cython_transform',
 '_define_paths',
 '_descending_count',
 '_dir_additions',
 '_dir_deletions',
 '_fill',
 '_get_cythonized_result',
 '_get_data_to_aggregate',
 '_get_index',
 '_get_indices',
 '_gotitem',
 '_group_selection',
 '_group_selection_context',
 '_hidden_attrs',
 '_indexed_output_to_ndframe',
 '_insert_inaxis_grouper_inplace',
 '_internal_names',
 '_internal_names_set',
 '_is_protocol',
 '_iterate_column_groupbys',
 '_iterate_slices',
 '_make_mask_from_int',
 '_make_mask_from_list',
 '_make_mask_from_positional_indexer',
 '_make_mask_from_slice',
 '_make_mask_from_tuple',
 '_make_wrapper',
 '_mask_selected_obj',
 '_numba_agg_general',
 '_numba_prep',
 '_obj_1d_constructor',
 '_obj_with_exclusions',
 '_positional_selector',
 '_python_agg_general',
 '_python_apply_general',
 '_reindex_output',
 '_reset_cache',
 '_reset_group_selection',
 '_resolve_numeric_only',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_set_group_selection',
 '_set_result_index_ordered',
 '_transform',
 '_transform_general',
 '_transform_item_by_item',
 '_transform_with_numba',
 '_wrap_agged_manager',
 '_wrap_aggregated_output',
 '_wrap_applied_output',
 '_wrap_applied_output_series',
 '_wrap_transform_fast_result',
 '_wrap_transformed_output',
 'agg',
 'aggregate',
 'all',
 'any',
 'apply',
 'backfill',
 'bfill',
 'boxplot',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'dtypes',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max',
 'mean',
 'median',
 'min',
 'ndim',
 'ngroup',
 'ngroups',
 'nth',
 'nunique',
 'ohlc',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'prod',
 'quantile',
 'rank',
 'resample',
 'rolling',
 'sample',
 'sem',
 'shift',
 'size',
 'skew',
 'std',
 'sum',
 'tail',
 'take',
 'transform',
 'tshift',
 'value_counts',
 'var']

In [18]:
df_grupo_suma.sum()

           VALOR   VALOR 2
CATEGORIA
Item       19868  19869.33
Item0      19275  19276.08
Item1      19691  19688.19
Item2      21397  21402.07
Item3      21634  21634.27
Item4      19795  19797.10
Item5      21800  21806.14
Item6      20778  20785.76

In [19]:
type(df_grupo_suma.sum())

pandas.core.frame.DataFrame

In [26]:
df2=df.describe()

In [27]:
df2

             VALOR      VALOR 2
count  3000.000000  3000.000000
mean     54.746000    54.752980
std      25.957929    25.960482
min      10.000000    10.010000
25%      32.750000    32.512500
50%      55.000000    54.765000
75%      77.000000    77.120000
max     100.000000    99.970000

In [29]:
df2.loc[['count','std'],'VALOR']

count    3000.000000
std        25.957929
Name: VALOR, dtype: float64

In [30]:
df3=df.T

In [31]:
df3

,0,1,2,3,4,5,6,7,8,9,...,2990,2991,2992,2993,2994,2995,2996,2997,2998,2999
CATEGORIA,Item4,Item,Item5,Item0,Item2,Item2,Item0,Item0,Item4,Item6,...,Item,Item3,Item,Item0,Item0,Item6,Item,Item3,Item1,Item
VALOR,87,46,84,35,10,89,59,58,83,68,...,92,73,31,24,71,52,89,16,12,69
VALOR 2,87.09,45.58,84.28,35.04,10.25,89.42,59.37,57.97,83.13,67.55,...,91.8,72.83,31.03,24.19,71.14,52.22,88.94,15.7,11.84,69.04
Date&Time,2021-08-01 18:07:20,2021-08-01 21:02:37,2021-08-01 23:57:53,2021-08-02 02:53:10,2021-08-02 05:48:27,2021-08-02 08:43:44,2021-08-02 11:39:00,2021-08-02 14:34:17,2021-08-02 17:29:34,2021-08-02 20:24:50,...,2022-07-31 16:49:50,2022-07-31 19:45:06,2022-07-31 22:40:23,2022-08-01 01:35:40,2022-08-01 04:30:56,2022-08-01 07:26:13,2022-08-01 10:21:30,2022-08-01 13:16:47,2022-08-01 16:12:03,2022-08-01 19:07:20

In [32]:
df.axes

[RangeIndex(start=0, stop=3000, step=1),
 Index(['CATEGORIA', 'VALOR', 'VALOR 2', 'Date&Time'], dtype='object')]

In [33]:
df.dtypes

CATEGORIA            object
VALOR                 int64
VALOR 2             float64
Date&Time    datetime64[ns]
dtype: object

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CATEGORIA  3000 non-null   object
 1   VALOR      3000 non-null   int64
 2   VALOR 2    3000 non-null   float64
 3   Date&Time  3000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 93.9+ KB

In [36]:
df.empty

False

In [37]:
df.rank()

      CATEGORIA   VALOR  VALOR 2  Date&Time
0        2039.0  2573.5   2575.0        1.0
1         172.5  1212.0   1190.5        2.0
2        2414.0  2479.5   2488.0        3.0
3         519.0   841.5    843.0        4.0
4        1259.5     7.0      6.5        5.0
...         ...     ...      ...        ...
2995     2805.5  1407.0   1418.0     2996.0
2996      172.5  2637.0   2631.0     2997.0
2997     1657.5   211.0    206.0     2998.0
2998      879.0    66.0     59.0     2999.0
2999      172.5  1974.5   1972.5     3000.0

[3000 rows x 4 columns]